In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  19  10   4  10  15
1  15   8  14   7  14
2   1   8   6  14   1
3   8   6  10   3  19
4   8   2  12  11   3

In [3]:
df.query('A > 10')

    A   B   C   D   E
0  19  10   4  10  15
1  15   8  14   7  14

In [4]:
rerata = df['A'].mean()
rerata

10.2

In [5]:
df.query('A > @rerata')

    A   B   C   D   E
0  19  10   4  10  15
1  15   8  14   7  14